#include <stdio.h>

int main() {
    int a, b, c; // 令三个数分别为a:b:c
    int i, j, s[9];
    for (a = 100; a < 1000; a++) { // 遍历所有可能的三位数a
        b = 2 * a; // 计算b的值
        c = 3 * a; // 计算c的值
        s[0] = a / 100; s[1] = a % 100 / 10; s[2] = a % 10; // 分离a的百位、十位、个位
        s[3] = b / 100; s[4] = b % 100 / 10; s[5] = b % 10; // 分离b的百位、十位、个位
        s[6] = c / 100; s[7] = c % 100 / 10; s[8] = c % 10; // 分离c的百位、十位、个位

        int flag = 1; // 标记是否满足条件
        for (i = 0; i < 8; i++) { // 判断是否有重复数字
            for (j = i + 1; j < 9; j++) {
                if (s[i] == s[j] || s[i] == 0 || s[j] == 0) {
                    flag = 0; // 如果有重复数字或0，则不满足条件
                    break;
                }
            }
            if (flag == 0) break; // 如果不满足条件，则跳出循环
        }
        if (flag == 1 && i == 8 && j == 9) { // 如果无重复数字、也无0
            printf("a=%d, b=%d, c=%d\n", a, b, c); // 输出满足条件的三个三位数
        }
    }
    return 0;
}
